//
//  InformationVC.swift
//  Homework-L6
//
//  Created by Ivy Angelova (Apprentice Mobile, eDynamix Training Programme) on 09/01/2023.
//

import UIKit

class DetailsVC: UIViewController {
    
    @IBOutlet weak var pictureImgView: UIImageView!
    @IBOutlet weak var textInfoTextView: UITextView!
    @IBOutlet weak var sliderEvaluate: UISlider!
    @IBOutlet weak var evaluateLabel: UILabel!
    @IBOutlet weak var evaluateBtn: UIButton!
    @IBOutlet weak var modeSwitch: UISwitch!
    
    var numberOfRowSelected: Int = -1
    
    override func viewDidLoad() {
        super.viewDidLoad()
        customizeView()
        // Do any additional setup after loading the view.
    }
    
    
    @IBAction func modeSwitchValueChanged(_ sender: UISwitch) {
        if modeSwitch.isOn {
            self.view.backgroundColor = UIColor.lightGray
            self.textInfoTextView.backgroundColor = UIColor.lightGray
        } else {
            self.view.backgroundColor = UIColor.white
            self.textInfoTextView.backgroundColor = UIColor.white
        }
    }
    
    @IBAction func evauateBtnTapped(_ sender: UIButton) {
        // Create new Alert
        let dialogMessage = UIAlertController(title: "Успешно оцени дестинацията!", message: nil,  preferredStyle: .alert)
        
        // Create OK button with action handler
        let ok = UIAlertAction(title: "OK", style: .default, handler: { (action) -> Void in
            print("Ok button tapped")
         })
        
        //Add OK button to a dialog message
        dialogMessage.addAction(ok)

        // Present Alert to
        self.present(dialogMessage, animated: true, completion: nil)
    }
    
    
    @IBAction func sliderValueChanged(_ sender: UISlider) {
        self.evaluateLabel.text = "Оцени мястото с:  " + String(format: "%.0f", self.sliderEvaluate.value)
    }
    
    
    func customizeView() {
        switch numberOfRowSelected {
        case 0:
            self.navigationItem.title = "Царевец"
            self.pictureImgView.image = UIImage(named: "carevec")
            self.textInfoTextView.text = """
В продължение на повече от две столетия Търновград е столица на Второто българско царство (края на XII – XIV в.). Той е центърът, в който се решават най-важните политически, религиозни, административни и културни въпроси в живота на средновековната държава. Съвременниците не пестят епитетите си наричайки го “Богоспасний Търновград”, “Великият Търнов”, “Царица на градовете” “…втори на думи и дела след Цариград”, славата му се носела в далечни земи, достигайки чак до “Северния океан”.

Градът Търново територията на която е населявана от дълбока древност, се превръща в столичен център след възстановяването на българската държава през 1186 г. За избора му благоприятстват стратегическото местоположение, общирната за застрояване площ и обстоятелството, че в края на XII в. той е един от най-укрепените градове. Всичко това дава добри възможности за развитието му като голям и многолюден градски център.

Столицата се разпростира върху укрепените с мощни крепостни стени хълмове Царевец, Трапезица, Момина крепост, склоновете към естествената водна преграда р. Янтра и надзаливните и тераси.
"""
        case 1:
            self.navigationItem.title = "Звук и светлина"
            self.pictureImgView.image = UIImage(named: "zvuk_svetlina")
            self.textInfoTextView.text = """
Целта на спектакъла е със средствата на музиката и ефектното осветление да се изгради един запомнящ се емоционален образ на хълма-крепост Царевец, събрал в себе си цялата историческа същност, величие и слава на древната престолнина Търновград – станал синоним на българския дух и национална гордост.

Водещ елемент е специално написаната музика, с помощта на която се проследяват историческите събития и се характеризират техните невидими образи.

Още първите звуци ни потапят в един нереален свят, далече назад във вековете, когато по тези земи са живеели траки, славяни и дошлите по-късно прабългари. Музикалната тема наслагва последователно мисли за създаването на Българската държава в 681 г., борбите за нейното укрепване, както и мирния градивен труд на свободолюбивия български народ.Постепенно ритъмът се усилва, навлизат нови теми, символизиращи набезите на един или друг неприятел, като най-тежкото е византийското нашествие през 1018 г. Тежката мантия на робството ляга над земята българска и сякаш от воплите на изстрадалия народ се надига мелодията на бунта. Въстанието през 1185 г.Донася свободата и славата на Търновград, станал столица на възстановената държава. Мирният и съзидателен труд създават великолепието и блясъка на Царевград, но в 1393 г. Черен облак забулва Балканите, а около стените на Царевец беснеят османските орди.
"""
        case 2:
            self.navigationItem.title = "Св. 40 мъченици"
            self.pictureImgView.image = UIImage(named: "st40")
            self.textInfoTextView.text = """
Тази църква е най-известният средновековен български паметник във Велико Търново. Построена е и е стенописана от българския владетел Иван Асен II в чест на голямата победа на българите при Клокотница над войските на епирския деспот кир Теодор Комнин на 22 март 1230 г. През XIII-XIV в. църквата „Св. Четиридесет мъченици“ е била главна църква на манастира „Великата лавра“, който се намирал в подножието на Царевец на левия бряг на Янтра. Била е още царска църква по време на Иван Асен II. Състои се от две части – продълговата базилика с шест колони, поставени в два реда, три полукръгли апсиди и един тесен притвор от запад, и от една пристройка, построена по-късно към западната и страна.

В годините на османското господство, вероятно до първата половина на XVIII в., църквата се запазва като християнска. С превръщането й в джамия стенописите, иконите и иконостасът са унищожени. През 1853 г. претърпява промени и самата постройка. Достигналата до наши дни живопис е от северната половина на западната страна на притвора. От запазените стенописи интерес представлява „Св. Елисавета Млекопитателница с младенеца Йоан“ (над входа) и „Св. Анна Млекопитателница“ (над входа от притвора в църквата), Върху останалото пространство на западната стена са представени отделни композиции – картинен календар в четири реда за месеците май, август, ноември.

В църквата „Св. Четиридесет мъченици“ се намират едни от най-значителните писмени паметници – Омуртаговата, Асеновата и Граничната колона от крепостта Родосто от времето на хан Крум. Системните археологически проучвания започват през 1969 г. Извънредно голям интерес предизвиква откритото през октомври 1972 г. Калояново погребение. То е на мъж, висок около 1,9 м, в богато войнско облекло, украсено със сложна шевица с вплетена златна сърма и бисери, на ръката със запазен масивен златен пръстен печат, тежащ 61,1 г, на който има хералдично изображение на барс и надпис в негатив: „Калоянов пръстен“. Със същия хералдичен знак през 1981 г. бе открит и печат – неопровержимо доказателство за гербовия знак на българите при Асеновци.
"""
            
        case 3:
            self.navigationItem.title = "Самоводска чаршия"
            self.pictureImgView.image = UIImage(named: "samovodska")
            self.textInfoTextView.text = """
Самоводската чаршия се създава през 60-те 70-те години на XIX в., когато Търново започва да расте на запад от стопанския център Баждарлък. Оформят се две улици с търговски и занятчийски дюкяни, работилници и ханове. Едната от тях започва от малък площад, сега известен като Самоводски пазар. През годините на Възраждането тук са бакалската, опинчарската, ковашката, халашката и др. чаршии, хаджи Давидовият, хаджи Великовият и на Атанас Йоноолу ханове. Тук е и метохът на Хилендарския манастир. По уличката, която тръгва на запад от Самоводския пазар, наред със занятчийските работилнички се намира запазеният и днес хан на Хаджи Николи.

След Освобождението тази стопанска част на Търново запазва дълго традициите на възрожденските занаятчийски чаршии. Тя става символ на занаятчийско-търговския характер на стария град.

Днес занятчийската чаршия е значим музеен обект във Велико Търново. Изграждането на комплекса, който включва Самоводския пазар и чаршията е част от програмата за развитие на Велико Търново като исторически, културен и туристически град. Комплексът се състои от реставрирани и адаптирани възрожденски или следосвобожденски къщи от втората половина или края на XIX в. с характерната за търновския стръмен терен раздвижена архитектура. Между тях е и родната къща на Емилиян Станев.
"""
        default:
            break
        }
        
        self.evaluateLabel.text = "Оцени мястото с:  " + String(format: "%.0f", self.sliderEvaluate.value)
        
    }
    
}
